In [102]:
#Create a data frame with 4 columns 4 rows
import pandas as pd
x=([[0,1,2,3],[1,2,3,4],[2,3,4,5],[3,4,5,6]])
d=pd.DataFrame(x,columns=['a','b','c','d'],index=['e','f','g','h'])
d

   a  b  c  d
e  0  1  2  3
f  1  2  3  4
g  2  3  4  5
h  3  4  5  6

In [103]:
#print all Columns form your data fraames
d.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [104]:
##print all rows from your data frame
d.loc['e':]

   a  b  c  d
e  0  1  2  3
f  1  2  3  4
g  2  3  4  5
h  3  4  5  6

In [105]:
#print Second column in your data frame
d[['b']]

   b
e  1
f  2
g  3
h  4

In [78]:
d.loc[['e','f','g','h'],["a","b"]]

   a  b
e  0  1
f  1  2
g  2  3
h  3  4

In [79]:
d.loc[['e'],:]

   a  b  c  d
e  0  1  2  3

In [80]:
d.loc['g':'h',['c','d']]

   c  d
g  4  5
h  5  6

In [81]:
d.iloc[2:3,[2,3]]

   c  d
g  4  5

In [84]:
d[["a"]]

   a
e  0
f  1
g  2
h  3

In [85]:
#print last 2 columns from your data Frame
d[['c','d']]

   c  d
e  2  3
f  3  4
g  4  5
h  5  6

In [86]:
#print fourth row from your data Frame
d.loc[['h']]

   a  b  c  d
h  3  4  5  6

In [87]:
#print first 2 Rows from your data Frame
d.loc[['e','f']]

   a  b  c  d
e  0  1  2  3
f  1  2  3  4

In [88]:
#print all rows and first 2 columns from your data Frame
d.loc['e':,'a':'b']

   a  b
e  0  1
f  1  2
g  2  3
h  3  4

In [89]:
#Delete any row from your data Frame
d.drop('f')

   a  b  c  d
e  0  1  2  3
g  2  3  4  5
h  3  4  5  6

In [90]:
#Delete any column from your data Frame
d.pop("d")

e    3
f    4
g    5
h    6
Name: d, dtype: int64

In [91]:
d

   a  b  c
e  0  1  2
f  1  2  3
g  2  3  4
h  3  4  5

In [92]:
#Add a column to a Data Frame
new=[7,8,9,10]
d["m"]=new
print(pd.DataFrame(new))

    0
0   7
1   8
2   9
3  10

In [93]:
d

   a  b  c   m
e  0  1  2   7
f  1  2  3   8
g  2  3  4   9
h  3  4  5  10

In [115]:
#Add a Row to Data Frame
new={'a':2,'b':3,'c':4,'m':6}
q=pd.DataFrame(new,index=['o'])
k=pd.concat([q,k])
k

   a  b  c  m
o  2  3  4  6
o  2  3  4  6

In [116]:
d

   a  b  c  d
e  0  1  2  3
f  1  2  3  4
g  2  3  4  5
h  3  4  5  6

In [95]:
#Iterate all Columns in your Data Frame and print result
for i in d.iteritems():
    print(i)

('a', e    0
f    1
g    2
h    3
Name: a, dtype: int64)
('b', e    1
f    2
g    3
h    4
Name: b, dtype: int64)
('c', e    2
f    3
g    4
h    5
Name: c, dtype: int64)
('m', e     7
f     8
g     9
h    10
Name: m, dtype: int64)

In [118]:
#Iterate the 3rd column values of your Data frame and print result.
d.iteritem('b')

AttributeError: 'DataFrame' object has no attribute 'iteritem'

In [96]:
#Iterate all Rows in your Data Frame and print result.
for i in d.iterrows():
    print(i)

('e', a    0
b    1
c    2
m    7
Name: e, dtype: int64)
('f', a    1
b    2
c    3
m    8
Name: f, dtype: int64)
('g', a    2
b    3
c    4
m    9
Name: g, dtype: int64)
('h', a     3
b     4
c     5
m    10
Name: h, dtype: int64)

In [97]:
#Read income.csv file and print as Data Frame
file="income.csv"
import pandas as pd
d=pd.read_csv(file)
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [98]:
#Get 2006 column info from your data Frame by using drop
d.drop(1)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528